RT-Thread/rt-thread/bsp/Infineon/libraries/IFX_PSOC6_HAL/mtb_shared/usbdev/cy_usb_dev.h
/***************************************************************************//**
* \file cy_usb_dev.h
* \version 2.10
*
* Provides API declarations of the USBFS device middleware.
*
********************************************************************************
* \copyright
* (c) 2018-2021, Cypress Semiconductor Corporation (an Infineon company) or
* an affiliate of Cypress Semiconductor Corporation. All rights reserved.
* You may use this file only in accordance with the license, terms, conditions,
* disclaimers, and limitations in the end user license agreement accompanying
* the software package with which this file was provided.
*******************************************************************************/


/**
* \mainpage USB Device Middleware Library 2.10
*
* The USB Device middleware provides a full-speed USB 2.0 Chapter 9 specification
* -compliant device framework. It uses the USBFS driver from PDL to interface
* with the hardware. The middleware provides support for Audio, CDC, and HID
* classes. Also, it allows implementing other class support.
* The USB Configurator tool makes it easy to construct the USB
* Device descriptor.
*
* <b>Features:</b>
* * USB Full-Speed Device Framework
* * \ref group_usb_dev_cfg_tool
* * The following USB Classes are supported:
*   * \ref group_usb_dev_audio_class_info
*   * \ref group_usb_dev_cdc_class_info
*   * \ref group_usb_dev_hid_class_info
*
********************************************************************************
* \section section_usb_dev_general General Description
********************************************************************************
*
* The USB Device structure is divided into  layers. The implementation
* is event-driven: the USBFS driver receives interrupts from the hardware and
* provides callbacks to the USB Device layer which implements them and provides
* events to the Class layer. A simplified image is shown below. \n \n
* \image html usb_dev_solution_struct.png
*
* Include cy_usb_dev.h along with the header for the USB class to be used
* (cy_usb_dev_hid.h, cy_usb_dev_cdc.h, cy_usb_dev_audio.h) to get access to
* all the functions and other declarations in this library.
* If you use ModusToolbox USB Device Configurator, also include cycfg_usbdev.h.
*
********************************************************************************
* \section section_usb_dev_quick_start Quick Start Guide
********************************************************************************
*
* Cypress USB Device middleware can be used in various software environments.
* Refer to the \ref section_usb_dev_toolchain.
* The quickest way to get started is using the Code Examples.
* Cypress Semiconductor continuously extends its portfolio of code examples
* at <a href="http://www.cypress.com"><b>Cypress Semiconductor website</b></a>
* and at <a href="https://github.com/cypresssemiconductorco">
* <b>Cypress Semiconductor GitHub</b></a>.
*
* This quick start guide is for an environment configured to use for development
* MTB CAT1A Peripheral Driver Library (PSoC6) or MTB CAT2 Peripheral Driver Library
* (PSoC4 & PMG1) included in the project.
*
* To easily run a USB, use the ModusToolbox USBCommDevice or USBM project.
* The steps below show how to set up a USB Device based on a basic
* ModusToolbox project (like Hello_World).
*
* The following steps set up a USB device recognized as an standard HID device -
* USB mouse and moves it from right to the left, and vice-versa.
* \note Some steps contain a corresponding to the figure below number in
* brackets.
*
* \subsection subsection_qsg_step1 STEP 1: Enable the USB Device middleware.
*
* Launch ModusToolbox Library Manager and enable the USB Device middleware.
* This step is required only if the ModusToolbox IDE is used. Otherwise, ensure
* the USB Device Middleware is included in your project.
*
* \subsection subsection_qsg_step2 STEP 2: Generate initialization code.
*
* 1.  Launch the ModusToolbox Device Configurator Tool and switch to the
*     Peripherals tab (#1.1).
* 2.  Enable the USB personality under Communication and enter Alias (#1.2).
*     We use USBHID in \ref section_usb_dev_quick_start
* 3.  Go to the Parameters pane and configure the USB personality: assign
*     the peripheral clock divider (#1.3) for Clock (Bus Reset).
*     Any available free divider can be used.
*     This is not required to be done for the PMG1 family of devices.
* 4.  Set Endpoint Mask to 1 to enable data endpoint 1 (#1.4) Enabled data
*     endpoints must match the descriptor tree in the USB Configurator.
*     \image html usb_dev_device_cfg.png
* 5.  Switch to the System tab (#2.1).
* 6.  Check the IMO clock is enabled (#2.2). Select Trim with USB (#2.3)
* 7.  Select one of the PLLs, if your device supports more than one.
*     Enable the PLL and set a frequency of 48 MHz (#2.4).
* 8.  Select the CLK_HF3 USB clock (#2.5). Assign the source clock to
*     the CLK_PATH connected to the configured previously PLL.<br>
*     (Not required for PMG1 devices) (#2.6).
* 9.  Check the FLL clock is enabled (Not required for PMG1 devices) (#2.7).
* 10. Select File->Save to generate initialization code.
*     \image html usb_dev_system_cfg.png
*
* \subsection subsection_qsg_step3 STEP 3: Generate USB descriptors.
*
* 1. Run the USB Configurator.
* 2. In the Device Descriptor node, set bDeviceClass - 0x02(#3.1),
*    iProduct - the device name to identify among connected devices. We use
*    "USB Device Quick Start guide"(#3.2).
* 3. Remove default Alternate Settings.
* 4. Add HID Alternate Settings.
* 5. Add HID Descriptor and select 3-Button Mouse in HID Report (#3.3).
* 6. Add Endpoint Descriptor and set: direction - IN,
*    Transfer Type - Interrupt, wMaxPacketSize - 3, bInterval - 10(#3.4).
* 7. Perform File->Save to generate initialization code. If configuration is
*    saved for the first time, choose a name (like design.cyusbdev) and save it
*    to the project root.
*    \image html usb_dev_configurator.png
*
* \subsection subsection_qsg_step4 STEP 4: Update main.c
*
* 1. Include the USB headers to get access to the generated descriptor
*    structures, USB driver, device, and class layers APIs.
*    \snippet usb_dev/snippet/main.c snipped_cy_usb_dev_headers
* 2. Declare the USB context global variables:
*    \snippet usb_dev/snippet/main.c snipped_cy_usb_dev_hid_globals
* 3. Configure the USB interrupt structures and declare interrupt handlers
*    (refer to the Configure Interrupts section of the USBFS
*    driver in the PDL API Reference).
*    \snippet usb_dev/snippet/main.c snipped_cy_usb_dev_interrupt_configuration
* 4. Implement the interrupt handlers:
*    \snippet usb_dev/snippet/main.c snipped_cy_usb_dev_interrupt_handlers
* 5. Update the main() function with the USB and interrupt initialization
*    routines:
*    \snippet usb_dev/snippet/main.c snipped_USB_Dev_InitEnableHID
* 6. Example of the routine to move mouse from right to the left,
*    and vice-versa.
*    \snippet usb_dev/snippet/main.c snipped_USB_Dev_MouseMove
*
* \subsection subsection_qsg_step5 STEP 5: Build and program the device.
*
* Connect the device to the Host PC. On the PC, verify a new USB device was
* enumerated as a mouse device. The mouse's cursor shall move left to
* right and vice-versa.
*
********************************************************************************
* \section group_usb_dev_configuration Configuration Considerations
********************************************************************************
*
* This section explains how to configure the USB Device for operation.
*
********************************************************************************
* \subsection group_usb_dev_config_drv Configure USBFS driver
********************************************************************************
*
* The driver and system resources configuration details are provided in the
* USBFS driver section Configuration Considerations in the PDL API Reference
* Manual. The provided code snippets expect that driver and system resources
* configuration is done.
*
********************************************************************************
* \subsection group_usb_dev_config_descr Construct USB Device Descriptors
********************************************************************************
*
* Run standalone USB Configurator tool to construct the USB Device descriptors.
* After USB Device descriptors are
* constructed, save generated source and header files. Add these files to your
* project. Open header files to get external definitions for:
* * USB Device configuration structure \ref cy_stc_usb_dev_config_t instance.
* * Array of USB Devices structures \ref cy_stc_usb_dev_device_t.
* * CDC and/or HID class configuration structure instances.
*
* These definitions will be required in the configuration steps provided below.
*
********************************************************************************
* \subsection group_usb_dev_config Configure USB Device
********************************************************************************
*
* To initialize the USB Device middleware, call \ref Cy_USB_Dev_Init function
* providing:
* * The pointer to the USBFS instance.
* * The pointer to the filled USBFS driver configuration structure cy_stc_usbfs_dev_drv_config_t.
* * The pointer to the allocated USBFS driver context structure cy_stc_usbfs_dev_drv_context_t.
* * The pointer to the generated middleware USB Device structure \ref cy_stc_usb_dev_device_t.
* * The pointer to the generated middleware USB Device configuration structure \ref cy_stc_usb_dev_config_t.
* * The pointer to the allocated middleware USB Device context structure \ref cy_stc_usb_dev_context_t.
*
********************************************************************************
* \subsection group_usb_dev_config_class Configure USB Classes
********************************************************************************
*
* The USB Device middleware provides support of Audio, HID, and CDC classes.
* Each class has own initialization function. This function must be called
* after \ref Cy_USB_Dev_Init to initialize class data and register it. The
* class-specific request will be passed to the class handler after registration.
* Note that the USB Configurator tool generates HID and CDC Class configuration
* structures that are required class initialization. Find these structure
* external declaration in the generated header file.
*
* To initialize the Audio Class, call \ref Cy_USB_Dev_Audio_Init function
* providing:
* * The NULL pointer (reserved for possible future use).
* * The pointer to the allocated Audio Class context structure \ref cy_stc_usb_dev_audio_context_t.
* * The pointer to the allocated USB Device context structure \ref cy_stc_usb_dev_context_t.
*
* To initialize the CDC Class, call \ref Cy_USB_Dev_CDC_Init function
* providing:
* * The pointer to the populated CDC Class configuration structure \ref cy_stc_usb_dev_cdc_config_t.
* * The pointer to the allocated CDC Class context structure \ref cy_stc_usb_dev_cdc_context_t.
* * The pointer to the allocated USB Device context structure \ref cy_stc_usb_dev_context_t.
*
* To initialize the HID Class, call \ref Cy_USB_Dev_HID_Init function
* providing:
* * The pointer to the populated HID Class configuration structure \ref cy_stc_usb_dev_hid_config_t.
* * The pointer to the allocated HID Class context structure \ref cy_stc_usb_dev_hid_context_t.
* * The pointer to the allocated USB Device context structure \ref cy_stc_usb_dev_context_t.
*
********************************************************************************
* \subsection group_usb_dev_config_enable Enable USB Device
********************************************************************************
*
* Finally, enable the USB Device operation calling \ref Cy_USB_Dev_Connect.
* This function call enables pull-up on D+ to signal USB Device connection on
* USB Bus. The USB Host detects device connection and starts device enumeration.
* It requests the device descriptors to define device capabilities and finally
* sets device configuration for the following operation.
* The \ref Cy_USB_Dev_Connect provides an argument to block until enumeration
* completes or exits after the USB Device is enabled.
*
* \snippet usb_dev/snippet/main.c snipped_Cy_USB_Dev_InitEnable
*
* \note
* The interrupts are mandatory for the USB Device operation. Therefore, USBFS
* interrupts must be enabled in the NVIC and global interrupts must be
* enabled as well.
*
********************************************************************************
* \section section_usb_dev_design Design Considerations
********************************************************************************
*
* The typical use case is that application calls the middleware API interface
* provided by the USB Device or Class layer to implement application logic.
* However, some features are provided only by the USBFS driver layer. Therefore, if
* the application needs them, the driver API interface must be used. The list of
* these features is provided in the section \ref group_usb_dev_drv_features.
*
********************************************************************************
* \subsection group_usb_dev_cfg_tool USB Configurator
********************************************************************************
*
* The standalone USB Configurator tool helps construct USB Device descriptors.
* The USB device descriptors
* provide to the USB Host complete information about the connected device. The tool
* output are generated source and header files that contain information about the
* USB Device: device descriptors plus structures that help access device
* descriptors. Generated files are mandatory for the middleware operation and must be
* added to your project. The header file provides access to
* instances of the USB Device configuration structure \ref cy_stc_usb_dev_config_t
* and array of the USB Device structures \ref cy_stc_usb_dev_device_t. Both these
* definitions are required for USB Device configuration. The tool also generates
* instances of configuration structures required for CDC and HID Class
* configuration.
*
* A detailed information about USB Descriptors is provided by the
* [USB Specification](http://www.usb.org/developers/docs/usb20_docs/)
*
* The USB Configurator tool provides the User Guide, which can be found in the
* documentation.
*
********************************************************************************
* \subsection group_usb_dev_std_requests Standard Request Support
********************************************************************************
*
* The USB Device supports standard requests listed in the table below.
*
* <table class="doxtable">
*   <tr><th>Standard Request</th><th>Request Processing Description</th><th>USB Spec Reference</th></tr>
*   <tr>
*     <td>CLEAR_FEATURE</td>
*     <td>Clears or disables a specific feature. Support recipients: Device,
*     Interface and Endpoint. The TEST_MODE feature selector is not supported.</td>
*     <td>9.4.1</td>
*   </tr>
*   <tr>
*     <td>GET_CONFIGURATION</td>
*     <td>Returns the current device configuration value.</td>
*     <td>9.4.2</td>
*   </tr>
*   <tr>
*     <td>GET_DESCRIPTOR</td>
*     <td>Returns the specified descriptor if the descriptor exists.</td>
*     <td>9.4.3</td>
*   </tr>
*   <tr>
*     <td>GET_INTERFACE</td>
*     <td>Returns the selected alternate interface setting for the specified
*     interface.</td>
*     <td>9.4.4</td>
*   </tr>
*   <tr>
*     <td>GET_STATUS</td>
*     <td>Returns status for the specified recipient. Support recipients:
*     Device, Interface, and Endpoint.</td>
*     <td>9.4.5</td>
*   </tr>
*   <tr>
*     <td>SET_ADDRESS</td>
*     <td>Sets the device address for all future device accesses.</td>
*     <td>9.4.6</td>
*   </tr>
*   <tr>
*     <td>SET_CONFIGURATION</td>
*     <td>Sets the device configuration. After this request, the device is ready for
*      communication.</td>
*     <td>9.4.7</td>
*   </tr>
*   <tr>
*     <td>SET_DESCRIPTOR</td>
*     <td>Not supported (optional request).</td>
*     <td>9.4.8</td>
*   </tr>
*   <tr>
*     <td>SET_FEATURE</td>
*     <td>Enables a specific feature. Support recipients: Device, Interface, and Endpoint.
*     The TEST_MODE feature selector is not supported.</td>
*     <td>9.4.9</td>
*   </tr>
*   <tr>
*     <td>SET_INTERFACE</td>
*     <td>Allows the USB Host to select an alternate setting for the specified
*     interface.</td>
*     <td>9.4.10</td>
*   </tr>
*   <tr>
*     <td>SYNCH_FRAME</td>
*     <td>Not supported.</td>
*     <td>9.4.11</td>
*   </tr>
* </table>
*
********************************************************************************
* \subsection group_usb_dev_audio_class_info Audio Class
********************************************************************************
*
* The USB Audio class can be used in a large amount of applications,
* either Made for iPod (MFI) or general USB Audio based. These applications
* consist of, but are not limited to, speakers, microphones, headsets, music
* creation tools (DJ equipment, guitar jacks, etc), and mixers.
* An additional application for the Audio class is in Musical Instrument
* Digital Interface (MIDI) applications. This interface uses a digital UART-like
* interface and allows the information to be sent across to the Host to
* be used with software applications, such as Apple Garage Band. Various
* instruments, such as electronic pianos, interface with MIDI.
*
* A detailed description about Audio Class is provided by the
* [USB Implementers Forum (USB-IF) Class Documentation]
* (http://www.usb.org/developers/docs/devclass_docs/)
*
* The Audio Class does not provide support any of Audio v1.0 or v2.0 requests
* processing and provides only the API interface to register Audio request handlers
* implemented on the application level. However, \ref group_usb_dev_cfg_tool
* supports Audio v1.0 or v2.0 descriptors.
*
* \note
* The MIDI Class support is not available in this version.
*
********************************************************************************
* \subsection group_usb_dev_cdc_class_info CDC: Communication Device Class
********************************************************************************
*
* Common use case for this class in a PSoC design is to replace a legacy serial
* (RS232) COM port with a USB connection. This allows customers to use
* legacy serial software while updating the communication interface to
* something more readily available on today's computers. The type of data
* that might be streamed across USB can vary depending on the end application.
* This could be as simple as streaming raw ADC counts to an entire command
* protocol. Additionally, CDC is extremely useful for debug purposes.
* Users can easily develop a USB interface that can send and receive
* information across CDC. On the Host side, GUI applications are widely
* available to view the data being transmitted, such as TeraTerm, Terminal,
* or Hyper-Terminal (depending on version of Microsoft Windows).
*
* A detailed description about CDC class is provided by the
* [USB Implementers Forum (USB-IF) Class Documentation]
* (http://www.usb.org/developers/docs/devclass_docs/)
*
* The CDC Class supports requests listed in the table below.
* <table class="doxtable">
*   <tr><th>Class Request</th><th>Request Processing Description</th><th>Communications Class Subclass Specification for PSTN Devices</th></tr>
*   <tr>
*     <td>SET_LINE_CODING</td>
*     <td>Allows the host to specify typical asynchronous line-character
*      formatting properties such as: data terminal rate, number of stop bits,
*      parity type and number of data bits. It applies to data transfers both
*      from the Host to the Device and from the Device to the Host.</td>
*     <td>6.3.10</td>
*   </tr>
*   <tr>
*     <td>GET_LINE_CODING</td>
*     <td>Allows the host to discover the currently configured line coding.</td>
*     <td>6.3.11</td>
*   </tr>
*   <tr>
*     <td>SET_CONTROL_LINE_STATE</td>
*     <td>Generates RS-232/V.24 style control signals - RTS and DTR.</td>
*     <td>6.3.12</td>
*   </tr>
* </table>
*
* The CDC Class supports notifications listed in the table below.
* <table class="doxtable">
*   <tr><th>Class Notification</th><th>Notification Processing Description</th><th>Communications Class Subclass Specification for PSTN Devices</th></tr>
*   <tr>
*     <td>SERIAL_STATE</td>
*     <td>Allows the Host to read the current state of the carrier detect (CD),
*      DSR, break, and ring signal (RI).</td>
*     <td>6.3.4</td>
*   </tr>
* </table>
*
********************************************************************************
* \subsection group_usb_dev_hid_class_info HID: Human Interface Device
********************************************************************************
*
* There are many possible use cases for HID depending on the end application.
* A keyboard/keypad is a common HID application that has been implemented
* previously with PSoC. Additionally, customers can use PSoC to implement a
* PC mouse or game controller device. A more generic use case seen is with
* regards to customers using USB as general-purpose interface between PSoC and
* the Host, without conforming to specific USAGE such as a Keyboard, Mouse, etc.
* Instead the user configures the HID descriptor to be a generic device, which
* allows them to transfer Vendor-Specific information, such as ADC data,
* button presses, etc., across the HID protocol. This allows customers to
* perform custom/generic data transfers over USB, without needing to provide
* an INF or SYS file during enumeration or worry about WHQL certification.
* All this is accomplished using the HID drivers that are built into all
* modern operation systems today. This includes Windows, Mac, and Linux.
*
* A detailed description about HID is provided by the
* [USB Implementers Forum (USB-IF) Class Documentation]
* (http://www.usb.org/developers/docs/devclass_docs/)
*
* The HID Class supports requests listed in the table below.
* <table class="doxtable">
*   <tr><th>Class Request</th><th>Request Processing Description</th><th>HID Spec Reference</th></tr>
*   <tr>
*     <td>GET_REPORT</td>
*     <td>Allows the USB Host to receive a report via the control pipe.</td>
*     <td>7.2.1</td>
*   </tr>
*   <tr>
*     <td>SET_REPORT</td>
*     <td>Allows the USB Host to send a report via the control pipe (set a
*         state of input, output, or feature report controls).</td>
*     <td>7.2.2</td>
*   </tr>
*   <tr>
*     <td>GET_IDLE</td>
*     <td>Reads the current idle rate for a particular Input report. \n
*      The recommended default idle rate (rate when the device is initialized)
*      is 500 milliseconds for keyboards (delay before first repeat rate) and
*      infinity for joysticks and mice.</td>
*     <td>7.2.3</td>
*   </tr>
*   <tr>
*     <td>SET_IDLE</td>
*     <td>Sets idle rate for a particular report. This request is used to limit
*      the reporting frequency of an interrupt in endpoint.\n
*      When the idle rate byte is 0 (zero), the duration is indefinite.
*      The endpoint reports only when a change is detected in the report data.
*      When the idle rate byte is non-zero, then a fixed duration is
*      used (defined by idle rate).</td>
*     <td>7.2.4</td>
*   </tr>
*   <tr>
*     <td>GET_PROTOCOL</td>
*     <td>Reads which protocol is currently active (either the boot or the
*         report protocol).</td>
*     <td>7.2.5</td>
*   </tr>
*   <tr>
*     <td>SET_PROTOCOL</td>
*     <td>Switches between the boot protocol and the report protocol (or vice versa).</td>
*     <td>7.2.6</td>
*   </tr>
* </table>
*
********************************************************************************
* \subsection group_usb_dev_class_x Adding Custom Class
********************************************************************************
*
