RT-Thread/rt-thread/bsp/Infineon/libraries/IFX_PSOC6_HAL/mtb_shared/usbdev/cy_usb_dev.h
* The USB Device middleware provides API interface that allows the user to
* implement custom class support. The middleware notifies registered class about
* following events:
* * Bus Reset detected ( \ref cy_cb_usb_dev_bus_reset_t ).
* * Set Configuration request received ( \ref cy_cb_usb_dev_set_config_t ).
* * Set Interface request received ( \ref cy_cb_usb_dev_set_interface_t ).
* * Setup packet received ( \ref cy_cb_usb_dev_request_received_t ).
* * Data is received in response for current setup packet ( \ref cy_cb_usb_dev_request_cmplt_t ).
*
* To create a new custom Class, follow the steps below:
* 1. Implement functions to service events (from the list above) required
*    for class operation. Typically, class should implement service of class-specific
*    requests therefore needs to implement functions defined by \ref cy_cb_usb_dev_request_received_t
*    and \ref cy_cb_usb_dev_request_cmplt_t.
* 2. Initialize instance of \ref cy_stc_usb_dev_class_t structure using implemented
*    service functions. Provide NULL pointer as function pointer if class does not
*    use this event.
* 3. Allocate instance of \ref cy_stc_usb_dev_class_ll_item_t structure to
*    provide storage for a linked list item of the class.
* 4. The class might need a context to store class-specific data. If needed,
*    define context type specific for this class and allocate it.
* 5. To enable class operation, this needs to be registered using
*    \ref Cy_USB_Dev_RegisterClass function after USB Device middleware is
*    initialized.
*
* Any of supported classes can be taken as an example to implement a custom class.
*
********************************************************************************
* \subsection group_usb_dev_vendor Vendor-Specific Requests Support
********************************************************************************
*
* The vendor-specific requests are STALLed by USB Device middleware by default.
* The exception is MS OS String vendor-specific request to retrieve an OS Feature
* Descriptor (Note that USB device must contain MS OS String descriptor to handle
* this vendor-specific by middleware).
* The middleware provides the \ref Cy_USB_Dev_RegisterVendorCallbacks function
* to register callbacks to handle vendor-specific requests.
*
********************************************************************************
* \subsection group_usb_dev_ep_buf_alloc Allocate Data Endpoint Buffer
********************************************************************************
*
* The application allocates buffers for data endpoints to operate. The buffer
* allocation depends on USBFS driver endpoint buffer access type configuration.
* It specifies which hardware register set 8-bit or 16-bit is used to access
* hardware endpoints buffer. The 16-bit access requires that the specific rules for
* the endpoints buffer allocation must be met (See Hardware Buffer Access
* section of the USBFS driver for more information). \n
* To make endpoint buffer allocation configuration independent, use
* the \ref CY_USB_DEV_ALLOC_ENDPOINT_BUFFER macro.
*
********************************************************************************
* \subsection group_usb_dev_self_powered_dev Self-Powered Devices
********************************************************************************
*
* The USB Device responds to GET_STATUS requests based on the status set with
* the \ref Cy_USB_Dev_SetPowerStatus function. To set the correct status,
* \ref Cy_USB_Dev_SetPowerStatus must be called during initialization if USB
* Device is configured as self-powered. The \ref Cy_USB_Dev_SetPowerStatus must
* be called any time the device changes status. A self-powered device also requires
* monitoring VBUS to control pull-up resistors. The pull-up resistor does
* not supply power to the data line until you call \ref Cy_USB_Dev_Connect.
* \ref Cy_USB_Dev_Disconnect disconnects the pull-up resistor from the data line.
* Find information about how to add VBUS monitoring in your application in the USBFS driver
* section VBUS Detection in the PDL API Reference Manual.
*
********************************************************************************
* \subsection group_usb_dev_std_timeout Timeout Function Redefinition
********************************************************************************
*
* The USB Device middleware provides following blocking functions: \ref Cy_USB_Dev_ReadEpBlocking,
* \ref Cy_USB_Dev_WriteEpBlocking, and \ref Cy_USB_Dev_Connect (the behavior
* defined by the blocking parameter of the connect function). The blocking functions
* parameter timeout defines how many milliseconds to wait before timeout.
* The SysLib driver function Cy_SysLib_Delay is used to implement a 1 millisecond
* wait cycle. The middleware provides function \ref Cy_USB_Dev_OverwriteHandleTimeout
* that allows overriding the wait function implementation. This might be
* useful when an operation system is used in your application.
*
* \note
* The blocking function must be used carefully to not cause application lock-up.
* The preferred solution is using non-blocking functions.
*
********************************************************************************
* \subsection group_usb_dev_drv_features Driver Features
********************************************************************************
*
* There are driver features that do not have corresponding an API
* interface provided in the middleware. However, the application might need
* these features for USB Device implementation. If there is such a need, the
* driver functions must be used. These features are listed below:
* * Data Endpoint 1 - 8 Completion, SOF received and LPM transfer ACKed events
*   notification.
* * Low power support: Suspend / Resume, Remote wakeup signaling.
* * Link Power Management (LPM) support.
*
* Find more information in the appropriate section of the USBFS driver documentation
* provided in the PDL API Reference Manual.
*
********************************************************************************
* \section section_usb_dev_toolchain Supported Software and Tools
********************************************************************************
*
* For supported software and tools, refer to the Supported Software and Tools
* section in in the
* [RELEASE.md](https://github.com/Infineon/usbdev/blob/master/RELEASE.md#supported-software-and-tools)
*
********************************************************************************
* \section section_usb_dev_errata Errata
********************************************************************************
*
* This section lists the known problems with the USB Device middleware.
*
* <table class="doxtable">
*   <tr><th>Cypress ID</th><th>Known Issue</th><th>Workaround</th></tr>
*   <tr>
*     <td>DRIVERS-1401</td>
*     <td>
*         The USB Device ignores LPM requests after wake up from Deep Sleep.
*     </td>
*     <td>
*         Call USBFS driver Cy_USBFS_Dev_Drv_Lpm_SetResponse() after calling
*         Cy_USBFS_Dev_Drv_Resume() to restore response to the LPM packets.
*     </td>
*   </tr>
*   <tr>
*     <td>DRIVERS-1427</td>
*     <td>
*         The USB Device modes with DMA do not work after wake up from Deep
*         Sleep, due to incorrect restore of the ARB_CFG register.
*     </td>
*     <td>
*         Save ARB_CFG values before entering Deep Sleep and restore it after
*         calling of Cy_USBFS_Dev_Drv_Resume.
*         \snippet usb_dev/snippet/main.c snippet_WorkaroundDmaResume
*     </td>
*   </tr>
* </table>
*
********************************************************************************
* \section group_usb_dev_changelog Changelog
********************************************************************************
*
* <table class="doxtable">
*   <tr><th>Version</th><th>Changes</th><th>Reason for Change</th></tr>
*   <tr>
*     <td rowspan="4">2.10</td>
*     <td>Updated Documentation</td>
*     <td>PMG1 Integration</td>
*   </tr>
*   <tr>
*     <td>Fixed vendor request handling</td>
*     <td>Defect Fixes</td>
*   </tr>
*   <tr>
*     <td>Added support for configurations without any data endpoints</td>
*     <td>Defect Fixes </td>
*   </tr>
*   <tr>
*     <td>Minor enhancements in several functions.</td>
*     <td>Enabled compliance with MISRA-C:2012 standard.</td>
*   </tr>
*   </tr>
*   <tr>
*     <td rowspan="5">2.0</td>
*     <td>Updated the internal processing  to support USBFS driver updates.</td>
*     <td>The USBFS driver is updated to v2.0.</td>
*   </tr>
*   <tr>
*     <td>Moved the timeout from Cy_USB_Dev_AbortEpTransfer() to the driver layer.
*         The maximum function's wait time is significantly reduced.</td>
*     <td>Align with the changes of the USBFS driver.</td>
*   </tr>
*   <tr>
*     <td>Changed the functions parameter name and the structure member name class to classObj.</td>
*     <td>Fixed the ambiguity related to the usage of the C++ keyword class as a name.</td>
*   </tr>
*   <tr>
*     <td>Enclosed middleware sources within a conditional compilation to
*         exclude the USB Device middleware for devices without USB hardware.</td>
*     <td>Fixed a compilation error for devices without USB hardware.</td>
*   </tr>
*   <tr>
*     <td>Updated the major and minor version defines to follow the naming convention.</td>
*     <td></td>
*   </tr>
*   <tr>
*     <td>1.0</td>
*     <td>The initial version.</td>
*     <td></td>
*   </tr>
* </table>
*
********************************************************************************
* \section group_usb_dev_more_information More Information
********************************************************************************
*
* For more information, refer to the links in the
* [README.md](https://github.com/Infineon/usbdev/blob/master/README.md#more-information)
*
* \note
* The links to the other software component's documentation (middleware and PDL)
* point to GitHub to the software latest available version.
* To get documentation of the specified version, download from GitHub and unzip
* the component archive. The documentation is available in the <i>docs</i> folder.
*
********************************************************************************
* \defgroup group_usb_device Device
* This section provides an API description for the core functionality of the
* USB Device: initialization, status information, data transfers, and class
* support.
* \{
*    \defgroup group_usb_dev_macros Macros
*    \{
*        \defgroup group_usb_dev_macros_device_descr Descriptors
*    \}
*
*    \defgroup group_usb_dev_functions Functions
*    \{
*        \defgroup group_usb_dev_functions_common        Initialization Functions
*        \defgroup group_usb_dev_functions_service       Service Functions
*        \defgroup group_usb_dev_functions_data_transfer Data Transfer Functions
*        \defgroup group_usb_dev_functions_vendor_support Vendor Request Support Functions
*        \defgroup group_usb_dev_functions_class_support Class Support Functions
*     \}
*
*     \defgroup group_usb_dev_data_structures Data Structures
*     \{
*         \defgroup group_usb_dev_structures_device       Device Information
*         \defgroup group_usb_dev_structures_device_descr Device Descriptors
*         \defgroup group_usb_dev_structures_control      Control Transfer
*         \defgroup group_usb_dev_structures_class        Class Support
*         \defgroup group_usb_dev_structures_func_ptr     Function Pointers
*     \}
*
*     \defgroup group_usb_dev_enums Enumerated Types
* \}
*
* \defgroup group_usb_dev_audio Audio Class
* \defgroup group_usb_dev_cdc CDC Class
* \defgroup group_usb_dev_hid HID Class
*
*/


