RT-Thread/rt-thread/bsp/Infineon/libraries/IFX_PSOC6_HAL/mtb_shared/usbdev/cy_usb_dev.h
#if !defined(CY_USB_DEV_H)
#define CY_USB_DEV_H

#include <stdint.h>
#include <stddef.h>
#include <stdbool.h>
#include <string.h>

#include "cy_usbfs_dev_drv.h"
#include "cy_usb_dev_descr.h"

#if (defined(CY_IP_MXUSBFS) || defined(CY_IP_M0S8USBDSS))

#if defined(__cplusplus)
extern "C" {
#endif

/**
* \addtogroup group_usb_dev_macros
* \{
*/

/*******************************************************************************
*                          Middleware Version
*******************************************************************************/

/** USB Device Middleware major version */
#define CY_USB_DEV_MW_VERSION_MAJOR  (2)

/** USB Device Middleware minor version */
#define CY_USB_DEV_MW_VERSION_MINOR  (10)

/** USB Device Middleware identifier */
#define CY_USB_DEV_ID             CY_PDL_DRV_ID(0x08U)

/** Maximum number of interfaces (this equals to the maximum number of hardware
* endpoints where each interface has at least one endpoint).
*/
#define CY_USB_DEV_NUM_INTERFACES_MAX   CY_USBFS_DEV_DRV_NUM_EPS_MAX

/** USBFS Device endpoint 0 packet size */
#define CY_USB_DEV_EP0_PACKET_SIZE      CY_USBFS_DEV_DRV_EP0_BUFFER_SIZE

/** Length of serial string number generated from silicon ID */
#define CY_USB_DEV_SN_STRING_LENGTH     (32U)

/** Length of serial string number */
#define CY_USB_DEV_SN_STRING_DESR_LENGTH    (CY_USB_DEV_SN_STRING_LENGTH + 2U)
/** \} group_usb_dev_macros */


/*******************************************************************************
*                              Enumerated Types
*******************************************************************************/

/**
* \addtogroup group_usb_dev_enums
* \{
*/

/** USBFS Device return codes */
typedef enum
{
    /** Operation completed successfully */
    CY_USB_DEV_SUCCESS = 0U,

    /** One or more input parameters are invalid */
    CY_USB_DEV_BAD_PARAM           = (CY_USB_DEV_ID | CY_PDL_STATUS_ERROR | 1U),

    /** The request is not handled */
    CY_USB_DEV_REQUEST_NOT_HANDLED = (CY_USB_DEV_ID | CY_PDL_STATUS_ERROR | 2U),

    /** Timeout occurred for the operation  */
    CY_USB_DEV_TIMEOUT            = (CY_USB_DEV_ID | CY_PDL_STATUS_ERROR | 3U),

    /** The hardware is busy executing previous operation */
    CY_USB_DEV_DRV_HW_BUSY         = (CY_USB_DEV_ID | CY_PDL_STATUS_ERROR | 4U),

    /** The hardware is disabled */
    CY_USB_DEV_DRV_HW_DISABLED     = (CY_USB_DEV_ID | CY_PDL_STATUS_ERROR | 5U),

    /** The hardware error occurred during operation */
    CY_USB_DEV_DRV_HW_ERROR        = (CY_USB_DEV_ID | CY_PDL_STATUS_ERROR | 6U),

} cy_en_usb_dev_status_t;

/** Device states */
typedef enum
{
    CY_USB_DEV_DISABLED,   /**< Device is disabled */
    CY_USB_DEV_ATTACHED,   /**< Device is attached */
    CY_USB_DEV_POWERED,    /**< Device is powered */
    CY_USB_DEV_DEFAULT,    /**< Device is in default state (after bus reset) */
    CY_USB_DEV_ADDRESSED,  /**< Device set address (device is ready to communicate using this address) */
    CY_USB_DEV_CONFIGURED  /**< Device is configured (device is ready to communicate using data endpoints) */
} cy_en_usb_dev_state_t;

/** Power Status */
typedef enum
{
    CY_USB_DEV_STATUS_BUS_POWERED,    /**< Device is bus powered */
    CY_USB_DEV_STATUS_SELF_POWERED    /**< Device is self powered */
} cy_en_usb_dev_power_status_t;

/** Callback events */
typedef enum
{
    CY_USB_DEV_EVENT_BUS_RESET,     /**< Bus Reset detected */
    CY_USB_DEV_EVENT_SET_CONFIG,    /**< SET_CONFIGURATION request received */
    CY_USB_DEV_EVENT_SET_INTERFACE  /**< SET_INTERFACE request received */
} cy_en_usb_dev_callback_events_t;
/** \} group_usb_dev_enums */


/*******************************************************************************
*                              Type Definitions
*******************************************************************************/

/**
* \addtogroup group_usb_dev_structures_control
* \{
*/

/** Parsed bmRequest */
typedef struct
{
    uint8_t direction;  /**< Transfer direction */
    uint8_t type;       /**< Transfer type */
    uint8_t recipient;  /**< Transfer recipient */
} cy_stc_usb_dev_bm_request;

/** Store request */
typedef struct
{
    cy_stc_usb_dev_bm_request bmRequestType; /**< Request type */
    uint8_t  bRequest;  /**< Request value */
    uint16_t wValue;    /**< Request value (2 bytes) */
    uint16_t wIndex;    /**< Request index (2 bytes) */
    uint16_t wLength;   /**< Request length (2 bytes) */
} cy_stc_usb_dev_setup_packet_t;

/** Execute transfer use this structure */
typedef struct
{
    cy_stc_usb_dev_setup_packet_t setup;  /**< Request packet */
    uint8_t  *ptr;          /**< Pointer to data to transfer or space to store data */
    uint8_t  *buffer;       /**< Pointer to buffer to store data send from host to device during control transfer */
    uint16_t remaining;     /**< Number of bytes remaining to complete send or receive */
    uint16_t size;          /**< Number of bytes to send or receive */
    uint16_t bufferSize;    /**< Size of the buffer to store data */
    uint8_t  direction;     /**< Transfer direction */
    bool     zlp;           /**< Defines whether zero length packet is needed to complete data stage */
    bool     notify;        /**< Defines whether trigger callback that notifies end of data stage (device received data) */
} cy_stc_usb_dev_control_transfer_t;

/** \} group_usb_dev_structures_control */


/** \cond INTERNAL */
/** Get compiler know what is cy_stc_usb_dev_context.
* The cy_stc_usb_dev_context_t is defined below.
*/
struct cy_stc_usb_dev_context;
/** \endcond */


/**
* \addtogroup group_usb_dev_structures_func_ptr
* \{
*/

/**
* Pointer to a function that implements a callback for the following events:
* Bus Reset detected, SET_CONFIGURATION request received and SET_INTERFACE request
* received. The notified events are defined by event argument
* (see \ref cy_en_usb_dev_callback_events_t).
* Only one event is notified when callback invoked.
* This callback invoked in the USB interrupt handler context and must be short
* as possible. \n
* Input arguments:
* * Bus Reset detected event: ignore wValue and wIndex arguments.
* * SET_CONFIGURATION request received event: the wValue is new configuration
*   value and wIndex can be ignored.
* * SET_CONFIGURATION request received event: the wValue is new alternative
*   setting value and wIndex interface value to which alternate belongs. \n
*
* The returned status defines following operation:
* * Bus Reset detected event: status is ignored and event processing is passed to
*   class event handlers.
* * SET_CONFIGURATION or SET_INTERFACE received event: the returned status defines
*   following request processing. If returned status fail the request is
*   STALLed and event notification stops.
*   If returned status is success the event is notified to the appropriate class
*   event handlers which status defines request response STALL or ACK.
*/
typedef cy_en_usb_dev_status_t (* cy_cb_usb_dev_events_callback_t)(cy_en_usb_dev_callback_events_t event,
                                                                   uint32_t wValue, uint32_t wIndex,
                                                                   struct cy_stc_usb_dev_context *devContext);

/**
* Pointer to a function that implements a timeout handler. The function accepts the
* number of milliseconds that remain to wait before timeout expires.
* This returns the number of milliseconds remaining to wait minus the milliseconds
* that have elapsed inside the function.
*/
typedef int32_t (* cy_fn_usb_dev_handle_timeout_ptr_t)(int32_t milliseconds);

/**
* Pointer to function that returns pointer to uint8_t array, which contains a serial number string
* and accepts the device context \ref cy_stc_usb_dev_context_t.
* This type is used to define a callback that returns serial number string.
*/
typedef uint8_t * (* cy_fn_usb_dev_sn_string_ptr_t)(void);

/**
* Pointer to function that returns nothing and accepts a pointer to void and a pointer to \ref cy_stc_usb_dev_context_t.
* This type is used to define a callback that notifies the class about a bus reset event.
*/
typedef void (* cy_cb_usb_dev_bus_reset_t)(void *classData, struct cy_stc_usb_dev_context *devContext);

/**
* Pointer to function that returns the status of operation and accepts received configuration number,
* pointer to class context, and pointer to device context \ref cy_stc_usb_dev_context_t.
* This type is used to define a callback that notifies the class about a set configuration request event.
*/
typedef cy_en_usb_dev_status_t (* cy_cb_usb_dev_set_config_t)(uint32_t configuration, void *classData,
                                                              struct cy_stc_usb_dev_context *devContext);

/**
* Pointer to function that returns the status of operation and accepts received interface
* alternate settings number, pointer to class context, and pointer to device context \ref cy_stc_usb_dev_context_t.
* This type is used to define a callback that notifies the class about a set interface request event.
*/
typedef cy_en_usb_dev_status_t (* cy_cb_usb_dev_set_interface_t)(uint32_t interface, uint32_t alternate,
                                                                 void *classContext,
                                                                 struct cy_stc_usb_dev_context *devContext);

/**
* Pointer to function that returns the status of operation and accepts pointer to received control transfer
* number, pointer to class context, and pointer to device context \ref cy_stc_usb_dev_context_t.
* This type is used to define a callback that notifies the class about a request received event.
*/
typedef cy_en_usb_dev_status_t (* cy_cb_usb_dev_request_received_t)(cy_stc_usb_dev_control_transfer_t *transfer,
                                                                    void *classContext,
                                                                    struct cy_stc_usb_dev_context *devContext);

/**
* Pointer to function that returns status of operation and accepts pointer to received control transfer
* number, pointer to class context, and pointer to device context \ref cy_stc_usb_dev_context_t.
* This type is used to define a callback that notifies the class that a request completed (data is received in
* response for current request) event.
*/
typedef cy_en_usb_dev_status_t (* cy_cb_usb_dev_request_cmplt_t)(cy_stc_usb_dev_control_transfer_t *transfer,
                                                                void *classContext,
                                                                struct cy_stc_usb_dev_context *devContext);

