RT-Thread/rt-thread/bsp/Infineon/libraries/IFX_PSOC6_HAL/mtb_shared/usbdev/cy_usb_dev.h
/** \} group_usb_dev_structures_func_ptr */

/**
* \addtogroup group_usb_dev_structures_class
* \{
*/

/** Class support definition - each class must provide this structure */
typedef struct
{
    /** Called after bus reset is serviced. Initialize Class here */
    cy_cb_usb_dev_bus_reset_t busReset;

    /**
    * Called after Set Configuration request is received.
    * The endpoint available for this configuration must be configured here.
    * Returns status of the event processing.
    */
    cy_cb_usb_dev_set_config_t setConfiguration;

    /**
    * Called after Set Interface request is received.
    * Probably the endpoint configuration requires correction here.
    * Returns status of the event processing.
    */
    cy_cb_usb_dev_set_interface_t setInterface;

    /**
    * This function is called when a setup packet was received from the USB Host but
    * was not recognized. Therefore, it might require the user to do the class processing.
    */
    cy_cb_usb_dev_request_received_t requestReceived;

    /**
    * This function is called when the USB Device received data from the USB Host
    * as part of current request processing. The requestReceivedHandle function
    * must enable notification to trigger this event. This makes sense only when CDC
    * request processing requires a data stage.
    */
    cy_cb_usb_dev_request_cmplt_t requestCompleted;

} cy_stc_usb_dev_class_t;


/** Class linked list element. It includes class and class data pointers
* and  pointer to the next class linked list element.
*/
typedef struct cy_stc_usb_dev_class_ll_item
{
    /** Next item in the class driver linked list */
    struct cy_stc_usb_dev_class_ll_item *next;

    /** Pointer to the class structure */
    cy_stc_usb_dev_class_t *classObj;

    /** Pointer to the class data (context) */
    void *classData;

} cy_stc_usb_dev_class_ll_item_t;
/** \} group_usb_dev_structures_class */


/**
* \addtogroup group_usb_dev_data_structures
* \{
*/
/** USB Device configuration structure */
typedef struct
{
    /** Pointer to the buffer to store data received from the USB Host through
    * Endpoint 0. The buffer size must be large enough to store received data
    * for all supported requests.
    */
    uint8_t  *ep0Buffer;

    /** Buffer size for Endpoint 0 */
    uint16_t  ep0BufferSize;

} cy_stc_usb_dev_config_t;


/** USB Device context structure.
* All fields for the USB Device context structure are internal. Firmware never
* reads or writes these values. Firmware allocates the structure and provides
* the address of the structure to the middleware in function calls. Firmware
* must ensure that the defined instance of this structure remains in scope while
* the middleware is in use.
*/
typedef struct cy_stc_usb_dev_context
{
    /** \cond INTERNAL*/

    /** Device state */
    volatile cy_en_usb_dev_state_t state;

    /** Configuration changed status */
    volatile bool configChanged;

    /** Device status */
    volatile uint8_t status;

    /** Device configuration */
    volatile uint8_t configuration;

    /** Device interface alternate settings */
    volatile uint8_t alternate[CY_USB_DEV_NUM_INTERFACES_MAX];

    /** Storage for serial number string descriptor (constructed from silicon ID) */
    uint8_t serialNumDescr[CY_USB_DEV_SN_STRING_DESR_LENGTH];

    /** Pointer to function that implements timeout in milliseconds */
    cy_fn_usb_dev_handle_timeout_ptr_t handleTimeout;

    /** Control transfer data */
    cy_stc_usb_dev_control_transfer_t ControlTransfer;

    /** Pointers to structure that describes device */
    const cy_stc_usb_dev_device_t *devDescriptors;

    /** Pointer to function that returns serial string */
    cy_fn_usb_dev_sn_string_ptr_t getSerialNumString;

    /** Callback for events: bus reset, set configuration and set interface */
    cy_cb_usb_dev_events_callback_t eventsCallback;

    /** Vendor-Specific callback to handle Setup packet received event */
    cy_cb_usb_dev_request_received_t vndRequestReceived;

    /** Vendor-Specific callback to handle notification that OUT stage is completed */
    cy_cb_usb_dev_request_cmplt_t vndRequestCompleted;

    /** Pointer to linked list of class structures */
    cy_stc_usb_dev_class_ll_item_t *classRoot;

    /** Pointer to driver base address */
    USBFS_Type *drvBase;

    /** Pointer to driver context */
    struct cy_stc_usbfs_dev_drv_context *drvContext;

    /** \endcond */
} cy_stc_usb_dev_context_t;
/** \} group_usb_dev_data_structures */


/*******************************************************************************
*                            Function Prototypes
*******************************************************************************/

/**
* \addtogroup group_usb_dev_functions_common
* \{
*/
cy_en_usb_dev_status_t Cy_USB_Dev_Init(USBFS_Type *base,
                                       struct cy_stc_usbfs_dev_drv_config const *drvConfig,
                                       struct cy_stc_usbfs_dev_drv_context      *drvContext,
                                       cy_stc_usb_dev_device_t  const *device,
                                       cy_stc_usb_dev_config_t  const *config,
                                       cy_stc_usb_dev_context_t       *context);

void Cy_USB_Dev_DeInit(cy_stc_usb_dev_context_t *context);
cy_en_usb_dev_status_t Cy_USB_Dev_Connect(bool blocking, int32_t timeout,
                                          cy_stc_usb_dev_context_t *context);
void Cy_USB_Dev_Disconnect(cy_stc_usb_dev_context_t *context);
/** \} group_usb_dev_functions_common */


/**
* \addtogroup group_usb_dev_functions_service
* \{
*/
__STATIC_INLINE void Cy_USB_Dev_RegisterEventsCallback(cy_cb_usb_dev_events_callback_t callback,
                                                       cy_stc_usb_dev_context_t *context);

__STATIC_INLINE uint32_t Cy_USB_Dev_GetConfiguration     (cy_stc_usb_dev_context_t const *context);
__STATIC_INLINE uint32_t Cy_USB_Dev_GetAlternateSettings (uint32_t interface,
                                                          cy_stc_usb_dev_context_t const *context);
__STATIC_INLINE bool    Cy_USB_Dev_IsConfigurationChanged(cy_stc_usb_dev_context_t *context);

__STATIC_INLINE bool Cy_USB_Dev_IsRemoteWakeupEnabled(cy_stc_usb_dev_context_t const *context);
__STATIC_INLINE void Cy_USB_Dev_SetPowerStatus       (cy_en_usb_dev_power_status_t status,
                                                      cy_stc_usb_dev_context_t     *context);

