RT-Thread/rt-thread/bsp/Infineon/libraries/IFX_PSOC6_HAL/mtb_shared/usbdev/cy_usb_dev.h
__STATIC_INLINE uint8_t* Cy_USB_Dev_GetSerialNumberString(cy_stc_usb_dev_context_t *context);
__STATIC_INLINE void     Cy_USB_Dev_RegisterSerialNumStringCallback(cy_fn_usb_dev_sn_string_ptr_t callback,
                                                                    cy_stc_usb_dev_context_t  *context);
__STATIC_INLINE cy_en_usb_dev_status_t Cy_USB_Dev_SetupControlRead(cy_stc_usb_dev_control_transfer_t *transfer,
                                                                   uint8_t *ptr,
                                                                   uint32_t size);

__STATIC_INLINE cy_en_usb_dev_status_t Cy_USB_Dev_SetupControlWrite(cy_stc_usb_dev_control_transfer_t *transfer,
                                                                    uint32_t size);

__STATIC_INLINE cy_en_usb_dev_status_t Cy_USB_Dev_SetupControlWriteResult(cy_stc_usb_dev_control_transfer_t const *transfer,
                                                                          uint8_t *ptr);
/** \cond INTERNAL */
__STATIC_INLINE uint32_t Cy_USB_Dev_GetConfigurationIdx(cy_stc_usb_dev_context_t const *context);
/** \endcond */

/** \} group_usb_dev_functions_service */


/**
* \addtogroup group_usb_dev_functions_data_transfer
* \{
*/
cy_en_usb_dev_status_t Cy_USB_Dev_StartReadEp(uint32_t endpoint,
                                              cy_stc_usb_dev_context_t *context);

cy_en_usb_dev_status_t Cy_USB_Dev_ReadEpBlocking(uint32_t endpoint,
                                                 uint8_t  *buffer,
                                                 uint32_t size,
                                                 uint32_t *actSize,
                                                 int32_t  timeout,
                                                 cy_stc_usb_dev_context_t *context);

cy_en_usb_dev_status_t Cy_USB_Dev_ReadEpNonBlocking(uint32_t  endpoint,
                                                    uint8_t  *buffer,
                                                    uint32_t  size,
                                                    uint32_t *actSize,
                                                    cy_stc_usb_dev_context_t *context);

cy_en_usb_dev_status_t Cy_USB_Dev_AbortEpTransfer(uint32_t endpoint,
                                                  cy_stc_usb_dev_context_t *context);

__STATIC_INLINE uint32_t Cy_USB_Dev_GetEpNumToRead(uint32_t endpoint,
                                                   cy_stc_usb_dev_context_t const *context);


cy_en_usb_dev_status_t Cy_USB_Dev_WriteEpBlocking(uint32_t endpoint,
                                                  uint8_t const *buffer,
                                                  uint32_t size,
                                                  int32_t  timeout,
                                                  cy_stc_usb_dev_context_t *context);

cy_en_usb_dev_status_t Cy_USB_Dev_WriteEpNonBlocking(uint32_t endpoint,
                                                     uint8_t const *buffer,
                                                     uint32_t size,
                                                     cy_stc_usb_dev_context_t *context);

__STATIC_INLINE void Cy_USB_Dev_OverwriteHandleTimeout(cy_fn_usb_dev_handle_timeout_ptr_t handleTimeout,
                                                       cy_stc_usb_dev_context_t *context);
/** \} group_usb_dev_functions_data_transfer */


/**
* \addtogroup group_usb_dev_functions_class_support
* \{
*/
cy_en_usb_dev_status_t Cy_USB_Dev_RegisterClass(cy_stc_usb_dev_class_ll_item_t *classItem,
                                                    cy_stc_usb_dev_class_t     *classObj,
                                                    void                       *classContext,
                                                    cy_stc_usb_dev_context_t   *context);

__STATIC_INLINE void Cy_USB_Dev_RegisterClassBusResetCallback(cy_cb_usb_dev_bus_reset_t callback,
                                                              cy_stc_usb_dev_class_t    *classObj);

__STATIC_INLINE void Cy_USB_Dev_RegisterClassSetConfigCallback(cy_cb_usb_dev_set_config_t callback,
                                                               cy_stc_usb_dev_class_t     *classObj);

__STATIC_INLINE void Cy_USB_Dev_RegisterClassSetInterfaceCallback(cy_cb_usb_dev_set_interface_t callback,
                                                                  cy_stc_usb_dev_class_t        *classObj);

__STATIC_INLINE void Cy_USB_Dev_RegisterClassRequestRcvdCallback(cy_cb_usb_dev_request_received_t callback,
                                                                 cy_stc_usb_dev_class_t           *classObj);

__STATIC_INLINE void Cy_USB_Dev_RegisterClassRequestCmpltCallback(cy_cb_usb_dev_request_cmplt_t callback,
                                                                  cy_stc_usb_dev_class_t        *classObj);
/** \} group_usb_dev_functions_class_support */

/**
* \addtogroup group_usb_dev_functions_vendor_support
* \{
*/
__STATIC_INLINE void Cy_USB_Dev_RegisterVendorCallbacks(cy_cb_usb_dev_request_received_t requestReceivedHandle,
                                                        cy_cb_usb_dev_request_cmplt_t    requestCompletedHandle,
                                                        cy_stc_usb_dev_context_t     *context);
/** \} group_usb_dev_functions_vendor_support */


/*******************************************************************************
*                                 API Constants
*******************************************************************************/

/**
* \addtogroup group_usb_dev_macros
* \{
*/

/** Timeout value that defines wait forever */
#define CY_USB_DEV_WAIT_FOREVER            (0)

/** Allocates static buffer for data endpoint. The size parameter must be a constant.
* The allocated buffer is aligned on a 2 byte boundary. <b>An odd buffer size is
* converted to even consuming 1 extra byte. The application must discard this
* extra byte</b>. This manipulation is needed to support different 8-bit and 16-bit
* hardware buffer access types in the driver (See Hardware Buffer Access
* section of the USBFS driver for more information).
*/
#define CY_USB_DEV_ALLOC_ENDPOINT_BUFFER(buf, size)  CY_USBFS_DEV_DRV_ALLOC_ENDPOINT_BUFFER(buf,size)

