RT-Thread/rt-thread/bsp/Infineon/libraries/IFX_PSOC6_HAL/mtb_shared/usbdev/cy_usb_dev.h
/* bmRequestType.Type: transfer direction */
#define CY_USB_DEV_DIR_HOST_TO_DEVICE    (0U) /**< Transfer direction from Host to Device (setup packet) */
#define CY_USB_DEV_DIR_DEVICE_TO_HOST    (1U) /**< Transfer direction from Device to Host (setup packet) */

/* bmRequestType.Type */
#define CY_USB_DEV_STANDARD_TYPE  (0U)    /**< Standard request type (setup packet) */
#define CY_USB_DEV_CLASS_TYPE     (1U)    /**< Class-specific request type (setup packet) */
#define CY_USB_DEV_VENDOR_TYPE    (2U)    /**< Vendor-specific request type (setup packet) */
#define CY_USB_DEV_RESERVED_TYPE  (3U)    /**< Reserved request type (setup packet) */

/* bmRequestType.Recipient */
#define CY_USB_DEV_RECIPIENT_DEVICE       (0U)    /**< Request recipient device (setup packet) */
#define CY_USB_DEV_RECIPIENT_INTERFACE    (1U)    /**< Request recipient interface (setup packet) */
#define CY_USB_DEV_RECIPIENT_ENDPOINT     (2U)    /**< Request recipient endpoint (setup packet) */
#define CY_USB_DEV_RECIPIENT_OTHER        (3U)    /**< Request recipient other (setup packet) */

/* USB v2.0 spec: Table 9-4. Standard Request Codes */
#define CY_USB_DEV_RQST_GET_STATUS        (0U)    /**< GET_STATUS standard request */
#define CY_USB_DEV_RQST_CLEAR_FEATURE     (1U)    /**< CLEAR_FEATURE standard request */
#define CY_USB_DEV_RQST_SET_FEATURE       (3U)    /**< SET_FEATURE standard request */
#define CY_USB_DEV_RQST_SET_ADDRESS       (5U)    /**< SET_ADDRESS standard request */
#define CY_USB_DEV_RQST_GET_DESCRIPTOR    (6U)    /**< GET_DESCRIPTOR standard request */
#define CY_USB_DEV_RQST_SET_DESCRIPTOR    (7U)    /**< SET_DESCRIPTOR standard request */
#define CY_USB_DEV_RQST_GET_CONFIGURATION (8U)    /**< GET_CONFIGURATION standard request */
#define CY_USB_DEV_RQST_SET_CONFIGURATION (9U)    /**< SET_CONFIGURATION standard request */
#define CY_USB_DEV_RQST_GET_INTERFACE     (10U)   /**< GET_INTERFACE standard request */
#define CY_USB_DEV_RQST_SET_INTERFACE     (11U)   /**< SET_INTERFACE standard request */
#define CY_USB_DEV_RQST_SYNCH_FRAME       (12U)   /**< SYNCH_FRAME standard request */

/* USB v2.0 spec: Table 9-6. Standard Feature Selectors */
#define CY_USB_DEV_DEVICE_REMOTE_WAKEUP   (1U)    /**< REMOTE_WAKEUP feature selector */
#define CY_USB_DEV_ENDPOINT_HALT          (0U)    /**< ENDPOINT_HALT feature selector */
#define CY_USB_DEV_ENDPOINT_STATUS_HALT   (1U)    /**< ENDPOINT_STATUS_HALT feature selector */
#define CY_USB_DEV_TEST_MODE              (2U)    /**< TEST_MODE feature selector */

/** \cond INTERNAL */
/* Vendor Specific Request: Microsoft OS String Descriptor */
#define CY_USB_DEV_RQST_GET_EXTENDED_CONFIG_DESCR   (0x01U)

/* Start position of SN string in SN string descriptor */
#define CY_USB_DEV_STRING_DESCR_SN_STR_POS  (2U)

/* USB v2.0 spec: Table 9-5. Descriptor Types */
#define CY_USB_DEV_GET_DESCR_TYPE(wValue) (CY_HI8(wValue))
#define CY_USB_DEV_GET_DESCR_IDX(wValue)  (CY_LO8(wValue))

/* Device status */
#define CY_USB_DEV_STATUS_BUS_POWERED_MASK    (0x0U)
#define CY_USB_DEV_STATUS_SELF_POWERED_MASK   (0x1U)
#define CY_USB_DEV_STATUS_REMOTE_WAKEUP_MASK  (0x2U)

/* Endpoint direction bit */
#define CY_USB_DEV_EP_IN_DIRECTION  (0x80U)
#define CY_USB_DEV_EP_NUM_MASK      (0x0FU)

#define CY_USB_DEV_EPADDR2EP(endpointAddr)      ((uint32_t) (endpointAddr) & CY_USB_DEV_EP_NUM_MASK)
#define CY_USB_DEV_IS_EP_DIR_IN(endpointAddr)   (0U != ((endpointAddr) & CY_USB_DEV_EP_IN_DIRECTION))
#define CY_USB_DEV_IS_EP_DIR_OUT(endpointAddr)  (0U == ((endpointAddr) & CY_USB_DEV_EP_IN_DIRECTION))

#if (CY_CPU_CORTEX_M0P)
    #define CY_USB_DEV_GET_CFG_WORD(addr)  ( (uint16_t) (((uint16_t) (* (((uint8_t const volatile *) (addr)) + 1U))) << 8U) | \
                                                                     (* (( uint8_t const volatile *) (addr))) )
#else
    #define CY_USB_DEV_GET_CFG_WORD(addr)  (* ((uint16_t const *) (addr)) )
#endif

/*
* These defines are obsolete and kept for backward compatibility only.
* They will be removed in the future versions.
*/
#define CY_USB_DEV_VERSION_MAJOR  (CY_USB_DEV_MW_VERSION_MAJOR)
#define CY_USB_DEV_VERSION_MINOR  (CY_USB_DEV_MW_VERSION_MINOR)

/** \endcond */

/** \} group_usb_dev_macros */


/*******************************************************************************
*                        In-line Function Implementation
*******************************************************************************/

/**
* \addtogroup group_usb_dev_functions_service
* \{
*/
/*******************************************************************************
* Function Name: Cy_USB_Dev_RegisterEventsCallback
****************************************************************************//**
*
* Registers a callback function to notify number of events: Bus Reset detected,
* SET_CONFIGURATION request received and SET_INTERFACE request received.
* To remove the callback function, pass NULL as the function pointer.
*
* \param callback
* The pointer to a callback function.
*
* \param context
* The pointer to the context structure \ref cy_stc_usb_dev_context_t allocated
* by the user. The structure is used during the USB Device operation for internal
* configuration and data retention. The user must not modify anything in this
* structure.
*
*******************************************************************************/
__STATIC_INLINE void Cy_USB_Dev_RegisterEventsCallback(cy_cb_usb_dev_events_callback_t callback,
                                                       cy_stc_usb_dev_context_t *context)
{
    context->eventsCallback = callback;
}


/*******************************************************************************
* Function Name: Cy_USB_Dev_GetConfiguration
****************************************************************************//**
*
* Returns USB Device configuration.
*
* \param context
* The pointer to the context structure \ref cy_stc_usb_dev_context_t allocated
* by the user. The structure is used during the USB Device operation for internal
* configuration and data retention. The user must not modify anything in this
* structure.
*
* \return
* Configuration value. The configuration value is 0 until USB Device
* was not enumerated by the USB Host.
*
*******************************************************************************/
__STATIC_INLINE uint32_t Cy_USB_Dev_GetConfiguration(cy_stc_usb_dev_context_t const *context)
{
    return (uint32_t) context->configuration;
}


/** \cond INTERNAL */
/*******************************************************************************
* Function Name: Cy_USB_Dev_GetConfigurationIdx
****************************************************************************//**
*
* This function returns current USB Device configuration index.
*
* \param context
* The pointer to the context structure \ref cy_stc_usb_dev_context_t allocated
* by the user. The structure is used during the USB Device operation for internal
* configuration and data retention. The user must not modify anything in this
* structure.
*
* \return
* Configuration index. If device is not configured, returns 0.
*
*******************************************************************************/
__STATIC_INLINE uint32_t Cy_USB_Dev_GetConfigurationIdx(cy_stc_usb_dev_context_t const *context)
{
    uint32_t configIdx = 0UL;

    if (CY_USB_DEV_CONFIGURED == context->state)
    {
        configIdx = (uint32_t) context->configuration - 1UL;
    }

    return configIdx;
}
/** \endcond */


