RT-Thread/rt-thread/bsp/Infineon/libraries/IFX_PSOC6_HAL/mtb_shared/usbdev/cy_usb_dev.h
/*******************************************************************************
* Function Name: Cy_USB_Dev_GetAlternateSettings
****************************************************************************//**
*
* Returns alternate setting for a certain interface.
* This function is useful to determine which alternate settings are active for
* a certain interface.
*
* \param interface
* Interface number.
*
* \param context
* The pointer to the context structure \ref cy_stc_usb_dev_context_t allocated
* by the user. The structure is used during the USB Device operation for internal
* configuration and data retention. The user must not modify anything in this
* structure.
*
* \return
* Alternate settings value.
*
*******************************************************************************/
__STATIC_INLINE uint32_t Cy_USB_Dev_GetAlternateSettings(uint32_t interface,
                                                         cy_stc_usb_dev_context_t const *context)
{
    CY_ASSERT_L1(interface < CY_USB_DEV_NUM_INTERFACES_MAX);

    return (uint32_t) context->alternate[interface];
}


/*******************************************************************************
* Function Name: Cy_USB_Dev_IsConfigurationChanged
****************************************************************************//**
*
* Returns configuration state that is cleared after read.
* This function is useful to determine which configuration or alternate settings
* of the interface were changed. After configuration state has been changed,
* \ref group_usb_dev_functions_data_transfer functions should be used to start
* communication with the USB Host.
*
* \param context
* The pointer to the context structure \ref cy_stc_usb_dev_context_t allocated
* by the user. The structure is used during the USB Device operation for internal
* configuration and data retention. The user must not modify anything in this
* structure.
*
* \return
* True - if configuration has been changed since last call. False - otherwise.
*
* \note
* This function is not interrupt-protected and to prevent a race condition,
* it should be protected from the USBFS interruption in the place where it
* is called.
*
*******************************************************************************/
__STATIC_INLINE bool Cy_USB_Dev_IsConfigurationChanged(cy_stc_usb_dev_context_t *context)
{
    bool isChanged = context->configChanged;

    if (isChanged)
    {
        context->configChanged = false;
    }

    return isChanged;
}


/*******************************************************************************
* Function Name: Cy_USB_Dev_SetPowerStatus
****************************************************************************//**
*
* Sets Power status to report it when USB Host issues GET_STATUS standard
* requests. Call this function any time when power source is changed from
* Self-Powered to Bus-Powered or vice versa.
*
* \param status
* Power status \ref cy_en_usb_dev_power_status_t
*
* \param context
* The pointer to the context structure \ref cy_stc_usb_dev_context_t allocated
* by the user. The structure is used during the USB Device operation for internal
* configuration and data retention. The user must not modify anything in this
* structure.
*
*******************************************************************************/
__STATIC_INLINE void Cy_USB_Dev_SetPowerStatus(cy_en_usb_dev_power_status_t status,
                                               cy_stc_usb_dev_context_t     *context)
{
    if (status == CY_USB_DEV_STATUS_SELF_POWERED)
    {
        context->status |= (uint8_t) CY_USB_DEV_STATUS_SELF_POWERED_MASK;
    }
    else
    {
        context->status &= (uint8_t) ~CY_USB_DEV_STATUS_SELF_POWERED_MASK;
    }
}


/*******************************************************************************
* Function Name: Cy_USB_Dev_IsRemoteWakeupEnabled
****************************************************************************//**
*
* Returns Remote Wakeup status.
* This function is useful to determine whether Remote Wakeup was enabled by the USB
* Host when USB Device supports this option.
*
* \param context
* The pointer to the context structure \ref cy_stc_usb_dev_context_t allocated
* by the user. The structure is used during the USB Device operation for internal
* configuration and data retention. The user must not modify anything in this
* structure.
*
* \return
* True - if Remote Wakeup was enabled by the USB Host. False - otherwise.
*
*******************************************************************************/
__STATIC_INLINE bool Cy_USB_Dev_IsRemoteWakeupEnabled(cy_stc_usb_dev_context_t const *context)
{
    return (0U != (context->status & CY_USB_DEV_STATUS_REMOTE_WAKEUP_MASK));
}


/*******************************************************************************
* Function Name: Cy_USB_Dev_GetSerialNumberString
****************************************************************************//**
*
* Returns pointer to the serial number string generated from silicon ID.
* The string length is \ref CY_USB_DEV_SN_STRING_LENGTH.
*
* \param context
* The pointer to the context structure \ref cy_stc_usb_dev_context_t allocated
* by the user. The structure is used during the USB Device operation for internal
* configuration and data retention. The user must not modify anything in this
* structure.
*
* \return
* The pointer to the serial number string.
*
*******************************************************************************/
__STATIC_INLINE uint8_t* Cy_USB_Dev_GetSerialNumberString(cy_stc_usb_dev_context_t *context)
{
    return &context->serialNumDescr[CY_USB_DEV_STRING_DESCR_SN_STR_POS];
}


/*******************************************************************************
* Function Name: Cy_USB_Dev_RegisterSerialNumStringCallback
****************************************************************************//**
*
* Registers a callback function that returns the serial string descriptor when
* it is requested by the USB Host.
*
* \param callback
* The pointer to a callback function.
*
* \param context
* The pointer to the context structure \ref cy_stc_usb_dev_context_t allocated
* by the user. The structure is used during the USB Device operation for internal
* configuration and data retention. The user must not modify anything in this
* structure.
*
*******************************************************************************/
__STATIC_INLINE void Cy_USB_Dev_RegisterSerialNumStringCallback(cy_fn_usb_dev_sn_string_ptr_t callback,
                                                                cy_stc_usb_dev_context_t  *context)
{
    context->getSerialNumString = callback;
}


