RT-Thread/rt-thread/bsp/Infineon/libraries/IFX_PSOC6_HAL/mtb_shared/usbdev/cy_usb_dev.h
/*******************************************************************************
* Function Name: Cy_USB_Dev_SetupControlRead
****************************************************************************//**
*
* Setup control read (Host reads) transfer.
*
* \param transfer
* Pointer to structure that holds SETUP packet and information for
* request processing.
*
* \param ptr
* The pointer to the data which will be read by the Host.
*
* \param size
* Number of bytes to read.
*
* \return
* Returns \ref CY_USB_DEV_SUCCESS (there is input parameters verification).
*
*******************************************************************************/
__STATIC_INLINE cy_en_usb_dev_status_t Cy_USB_Dev_SetupControlRead(cy_stc_usb_dev_control_transfer_t *transfer,
                                                                   uint8_t  *ptr,
                                                                   uint32_t size)
{
    /* Setup control transfer (Host reads) */
    transfer->ptr       = ptr;
    transfer->remaining = (uint16_t) size;

    return CY_USB_DEV_SUCCESS;
}


/*******************************************************************************
* Function Name: Cy_USB_Dev_SetupControlWrite
****************************************************************************//**
*
* Setup control write transfer (Host writes) and sets \ref CY_USB_DEV_SUCCESS status
*
* \param transfer
* Pointer to structure that holds SETUP packet and information for
* request processing.
*
* \param size
* Number of bytes which Host is allowed to write.
*
* \return
* Returns \ref CY_USB_DEV_SUCCESS (there is input parameters verification).
*
*******************************************************************************/
__STATIC_INLINE cy_en_usb_dev_status_t Cy_USB_Dev_SetupControlWrite(cy_stc_usb_dev_control_transfer_t *transfer,
                                                                    uint32_t size)
{
    /* Setup control transfer (Host writes) */
    transfer->remaining = (uint16_t) size;
    transfer->notify    = true;

    return CY_USB_DEV_SUCCESS;
}


/*******************************************************************************
* Function Name: Cy_USB_Dev_SetupControlWriteResult
****************************************************************************//**
*
* Copies data received from the Host into the specified memory location. There
* must provide enough place to store number of bytes provided in
* \ref Cy_USB_Dev_SetupControlWrite.
*
* \param transfer
* Pointer to structure that holds SETUP packet and information for
* request processing.
*
* \param ptr
* The pointer to the memory location to copy to.
*
* \return
* Returns \ref CY_USB_DEV_SUCCESS (there is input parameters verification).
*
*******************************************************************************/
__STATIC_INLINE cy_en_usb_dev_status_t Cy_USB_Dev_SetupControlWriteResult(cy_stc_usb_dev_control_transfer_t const *transfer,
                                                                         uint8_t *ptr)
{
    /* Copy data from internal buffer to the user provided location */
    (void) memcpy(ptr, transfer->buffer, (uint32_t) transfer->size);

    return CY_USB_DEV_SUCCESS;
}
/** \} group_usb_dev_functions_service */


/**
* \addtogroup group_usb_dev_functions_data_transfer
* \{
*/
/*******************************************************************************
* Function Name: Cy_USB_Dev_GetEpNumToRead
****************************************************************************//**
*
* Returns the number of bytes that available to be read from a certain
* endpoint buffer. Before calling this function ensure that the Host wrote data
* into the endpoint. The returned value is updated after the Host access to the
* endpoint but remains unchanged after data has been read from the endpoint
* buffer.
*
* \param endpoint
* The OUT data endpoint number.
*
* \param context
* The pointer to the context structure \ref cy_stc_usb_dev_context_t allocated
* by the user. The structure is used during the USB Device operation for internal
* configuration and data retention. The user must not modify anything in this
* structure.
*
* \return
* Number of bytes in OUT endpoint buffer.
*
*******************************************************************************/
__STATIC_INLINE uint32_t Cy_USB_Dev_GetEpNumToRead(uint32_t endpoint,
                                                   cy_stc_usb_dev_context_t const *context)
{
    return Cy_USBFS_Dev_Drv_GetEndpointCount(context->drvBase, endpoint);
}


/*******************************************************************************
* Function Name: Cy_USB_Dev_OverwriteHandleTimeout
****************************************************************************//**
*
* Overwrite the handle timeout function that is implemented internally.
* The internal implementation converts one timeout unit to milliseconds.
*
* \param handleTimeout
* The pointer to function to be executed to handle timeout for blocking
* operations.
*
* \param context
* The pointer to the context structure \ref cy_stc_usb_dev_context_t allocated
* by the user. The structure is used during the USB Device operation for internal
* configuration and data retention. The user must not modify anything in this
* structure.
*
*******************************************************************************/
__STATIC_INLINE void Cy_USB_Dev_OverwriteHandleTimeout(cy_fn_usb_dev_handle_timeout_ptr_t handleTimeout,
                                                       cy_stc_usb_dev_context_t *context)
{
    context->handleTimeout = handleTimeout;
}
/** \} group_usb_dev_functions_data_transfer */

/**
* \addtogroup group_usb_dev_functions_class_support
* \{
*/
/*******************************************************************************
* Function Name: Cy_USB_Dev_RegisterClassBusResetCallback
****************************************************************************//**
*
* Registers a callback function to notify a certain class about a Bus Reset event.
* To remove the callback function, pass NULL as the function pointer.
*
* \param callback
* The pointer to a callback function.
*
* \param classObj
* The pointer to the class structure.
*
*******************************************************************************/
__STATIC_INLINE void Cy_USB_Dev_RegisterClassBusResetCallback(cy_cb_usb_dev_bus_reset_t callback,
                                                              cy_stc_usb_dev_class_t    *classObj)
{
    classObj->busReset = callback;
}


