RT-Thread/rt-thread/bsp/Infineon/libraries/IFX_PSOC6_HAL/mtb_shared/usbdev/cy_usb_dev.h
/*******************************************************************************
* Function Name: Cy_USB_Dev_RegisterClassSetConfigCallback
****************************************************************************//**
*
* Registers a callback function to notify a certain class that SET_CONFIGURATION
* request was received from USB Host.
* To remove the callback function, pass a NULL as the function pointer.
*
* \param callback
* The pointer to a callback function.
*
* \param classObj
* The pointer to the class structure.
*
*******************************************************************************/
__STATIC_INLINE void Cy_USB_Dev_RegisterClassSetConfigCallback(cy_cb_usb_dev_set_config_t callback,
                                                               cy_stc_usb_dev_class_t     *classObj)

{
    classObj->setConfiguration = callback;
}


/*******************************************************************************
* Function Name: Cy_USB_Dev_RegisterClassSetInterfaceCallback
****************************************************************************//**
*
* Registers a callback function to notify a certain class that SET_INTERFACE
* request was received from the USB Host.
* To remove the callback function, pass a NULL as the function pointer.
*
* \param callback
* The pointer to a callback function.
*
* \param classObj
* The pointer to the class structure.
*
*******************************************************************************/
__STATIC_INLINE void Cy_USB_Dev_RegisterClassSetInterfaceCallback(cy_cb_usb_dev_set_interface_t callback,
                                                                  cy_stc_usb_dev_class_t        *classObj)
{
    classObj->setInterface = callback;
}


/*******************************************************************************
* Function Name: Cy_USB_Dev_RegisterClassRequestRcvdCallback
****************************************************************************//**
*
* Registers a callback function to notify a certain class that setup packet was
* received from USB Host but was not recognized. Therefore, this might require
* manual class processing.
* To remove the callback function, pass a NULL as the function pointer.
*
* \param callback
* The pointer to a callback function.
*
* \param classObj
* The pointer to the class structure.
*
*******************************************************************************/
__STATIC_INLINE void Cy_USB_Dev_RegisterClassRequestRcvdCallback(cy_cb_usb_dev_request_received_t callback,
                                                                 cy_stc_usb_dev_class_t           *classObj)
{
    classObj->requestReceived = callback;
}


/*******************************************************************************
* Function Name: Cy_USB_Dev_RegisterClassRequestCmpltCallback
****************************************************************************//**
*
* Registers a callback function to notify a certain class that the USB Device
* received data from the USB Host as part of current request processing.
* The class setup packet callback function must enable notification to trigger
* this event. This makes sense only when class request processing requires a data
* stage.
* To remove callback function pass NULL as function pointer.
*
* \param callback
* The pointer to a callback function.
*
* \param classObj
* The pointer to the class structure.
*
*******************************************************************************/
__STATIC_INLINE void Cy_USB_Dev_RegisterClassRequestCmpltCallback(cy_cb_usb_dev_request_cmplt_t callback,
                                                                  cy_stc_usb_dev_class_t        *classObj)
{
    classObj->requestCompleted = callback;
}
/** \} group_usb_dev_functions_class_support */

/**
* \addtogroup group_usb_dev_functions_vendor_support
* \{
*/
/*******************************************************************************
* Function Name: Cy_USB_Dev_RegisterVendorCallbacks
****************************************************************************//**
*
* Registering user callback to handle Vendor-Specific requests.
*
* \param requestReceivedHandle
* The pointer to a callback function.
* This function is called when setup packet was received from USB Host but was
* not recognized. Therefore this might require manual class processing.
* To remove the callback function, pass a NULL as the function pointer.
*
* \param requestCompletedHandle
* The pointer to a callback function.
* This function is called when the USB Device received data from the USB Host
* as part of current request processing. The requestReceivedHandle function
* must enable notification to trigger this event. This makes sense only when CDC
* request processing requires a data stage.
* To remove callback function pass NULL as function pointer.
*
* \param context
* The pointer to the context structure \ref cy_stc_usb_dev_context_t allocated
* by the user. The structure is used during the USB Device operation for internal
* configuration and data retention. The user must not modify anything in this
* structure.
*
* \note
* The callbacks registered by this function does not overrides processing of
* MS OS String vendor-specific request to retrieve an OS Feature Descriptor.
*
*******************************************************************************/
__STATIC_INLINE void Cy_USB_Dev_RegisterVendorCallbacks(cy_cb_usb_dev_request_received_t requestReceivedHandle,
                                                        cy_cb_usb_dev_request_cmplt_t    requestCompletedHandle,
                                                        cy_stc_usb_dev_context_t     *context)
{
    context->vndRequestReceived  = requestReceivedHandle;
    context->vndRequestCompleted = requestCompletedHandle;
}
/** \} group_usb_dev_functions_vendor_support */

/** \} group_usb_dev */

#if defined(__cplusplus)
}
#endif

#endif /* (defined(CY_IP_MXUSBFS) || defined(CY_IP_M0S8USBDSS)) */

#endif /* (CY_USB_DEV_H) */


/* [] END OF FILE */
